"Bass Frequency" = "Częstotliwość niskich tonów"; 
"Bass Gain" = "Wzmocnienie niskich tonów"; 
"Low Mid Frequency" = "Niskie średnie częstotliwości";
"Low Mid Gain" = "Wzmocnienie niskich średnich częstotliwości";
"High Mid Frequency" = "Wysokie średnie częstotliwości";
"High Mid Gain" = "Wzmocnienie wysokich średnich częstotliwości";
"Treble Frequency" = "Częstotliwość wysokich tonów";
"Treble Gain" = "Wzmocnienie wysokich tonów";
